{
  "architectures": ["DeepseekV3ForCausalLM"],
  "model_type": "deepseek_v3",
  "hidden_size": 768,
  "intermediate_size": 2048,
  "vocab_size": 129280,
  "num_hidden_layers": 8,
  "num_attention_heads": 12,
  "num_key_value_heads": 12,
  "max_position_embeddings": 4096,
  "kv_lora_rank": 128,
  "qk_nope_head_dim": 64,
  "qk_rope_head_dim": 64,
  "v_head_dim": 64,
  "first_k_dense_replace": 999,
  "moe_layer_freq": 1,
  "scoring_func": "sigmoid",
  "topk_method": "noaux_tc",
  "norm_topk_prob": false,
  "routed_scaling_factor": 1.0,
  "rope_theta": 10000.0,
  "rope_scaling": null,
  "q_lora_rank": null,
  "torch_dtype": "bfloat16",
  "tie_word_embeddings": false
}
