{
  "architectures": ["DeepseekV3ForCausalLM"],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 0,
  "eos_token_id": 1,
  "model_type": "deepseek_v3",
  "hidden_size": 768,
  "hidden_act": "silu",
  "initializer_range": 0.02,
  "intermediate_size": 8192,
  "vocab_size": 129280,
  "num_hidden_layers": 14,
  "num_attention_heads": 12,
  "max_position_embeddings": 4096,
  "kv_lora_rank": 256,
  "qk_nope_head_dim": 64,
  "qk_rope_head_dim": 64,
  "v_head_dim": 128,
  "first_k_dense_replace": 14,
  "rms_norm_eps": 1e-6,
  "rope_theta": 10000.0,
  "rope_scaling": null,
  "q_lora_rank": null,
  "torch_dtype": "bfloat16",
  "tie_word_embeddings": true
}
