{
  "architectures": ["DeepseekV3ForCausalLM"],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 0,
  "eos_token_id": 1,
  "model_type": "deepseek_v3",
  "hidden_size": 1536,
  "hidden_act": "silu",
  "initializer_range": 0.02,
  "intermediate_size": 2048,
  "vocab_size": 129280,
  "num_hidden_layers": 16,
  "num_attention_heads": 24,
  "max_position_embeddings": 4096,
  "kv_lora_rank": 512,
  "qk_nope_head_dim": 64,
  "qk_rope_head_dim": 64,
  "v_head_dim": 128,
  "first_k_dense_replace": 2,
  "moe_layer_freq": 1,
  "moe_intermediate_size": 2560,
  "n_group": 4,
  "n_routed_experts": 8,
  "n_shared_experts": 1,
  "num_experts_per_tok": 2,
  "rms_norm_eps": 1e-6,
  "scoring_func": "sigmoid",
  "topk_group": 2,
  "topk_method": "noaux_tc",
  "norm_topk_prob": true,
  "routed_scaling_factor": 2.5,
  "rope_theta": 10000.0,
  "rope_scaling": null,
  "q_lora_rank": null,
  "torch_dtype": "bfloat16",
  "tie_word_embeddings": false
}
